app/controllers/profile_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
	def index
		@user=User.find_by_id(params[:id])

UPDATE `profiles` SET `first_name` = 'ffffffffffffffffffff', `last_name` = 'lllllllllllllllllllllllll', `updated_at` = '2012-09-03 12:37:42' WHERE `profiles`.`id` = 6
---
	def update
		@user=current_user
		@user.profile[:first_name]=params[:profile][:first_name]
		@user.profile[:last_name]=params[:profile][:last_name]
		@user.profile[:sex]=params[:profile][:sex]
		@user.profile.save