app/controllers/sections_controller.rb

SELECT `stories`.* FROM `stories` WHERE `stories`.`id` = 2 LIMIT 1
---
	def new
		@story = Story.find(params[:story_id])

SELECT `stories`.* FROM `stories` WHERE `stories`.`id` = 1 LIMIT 1
---
	def index
		story = Story.find(params[:story_id])

SELECT `stories`.* FROM `stories` WHERE `stories`.`id` = 2 LIMIT 1
INSERT INTO `sections` (`content`, `created_at`, `name`, `rating`, `story_id`, `updated_at`, `user_id`) VALUES ('once upon a time.....', '2012-09-25 10:28:56', 'Intro', NULL, 2, '2012-09-25 10:28:56', NULL)
---
	def create
		@story = Story.find(params[:story_id])
		newsection = @story.sections.new(params[:section])
		newsection.user_id = current_user.id
		newsection.save