app/controllers/stories_controller.rb

SELECT `stories`.* FROM `stories`
---
	def index
		@stories = Story.all

INSERT INTO `stories` (`created_at`, `name`, `updated_at`, `user_id`) VALUES ('2012-09-04 10:19:53', NULL, '2012-09-04 10:19:53', 1)
---
	def create
		@user=current_user
		x=@user.stories.new(:name=>params[:story][:name])
		x.save

SELECT `stories`.* FROM `stories` WHERE `stories`.`id` IN ('id') LIMIT 1
---
	def show
		@story = Story.find(params[:id])