app/views/profile/_show_profile.html.erb


<b>First name  </b><%= @user.profile.first_name%></br>
---
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1 LIMIT 1